[
    {
        "tag": "ai",
        "title": "Artificial Intelligence (AI)",
        "intro": "Machines that can learn, adapt and automate processes are finally driving second order innovation as organisations take hold of these technologies and use them. While AI comes with great potential upsides that will benefit many, it is not without perils either.",
        "tagimage": "../img/posts/tag_ai.png"
    },
    {
        "tag": "android",
        "title": "Android operating system",
        "intro": "As an alternative to iOS, Windows and Linux, Android is an OS that powers billions of devices globally. Being open-source fosters innovation and flexibility, allowing it to be used in everything from phones to desktops to IoT devices to gaming consoles and more.",
        "tagimage": "../img/posts/tag_android.png"
    },
    {
        "tag": "Apple",
        "title": "Apple computing company",
        "intro": "Apple has redefined technology and interaction many times with its innovative approach to hardware, software and design. From the stalwart Mac to iPhones and iPads, it creates a seamless ecosystem of devices and services. Apple's Second Mouse strategy coupled with its focus on simplicity, performance and great design influences how we interact with the digital world.",
        "tagimage": "../img/posts/tag_apple.png"
    },
    {
        "tag": "development",
        "title": "Software development",
        "intro": "Coding languages, frameworks, methodologies, libraries, platforms - all of these come together to help developers build software. From APIs and SaaS applications running in the cloud to firmware driving IoT devices, development is the creative problem-solving that sits at the heart of all of it.",
        "tagimage": "../img/posts/tag_development.png"
    },
    {
        "tag": "hardware",
        "title": "Hardware: Inside the machine",
        "intro": "Forming the backbone of all tech, hardware is the physical componentry that enable all other systems to function. Encompassing microcontollers, single board computers or advanced GPUs or servers, innovation in hardware fuels growth across the technology landscape.",
        "tagimage": "../img/posts/tag_hardware.png"
    },
    {
        "tag": "mobile",
        "title": "Mobile technology",
        "intro": "The way we work, communicate, and engage with the digital world has fundamentally changed as a result of mobile computing. As platforms develop, they continue to transform personal computing, enhance user experiences, and drive innovation across domains.",
        "tagimage": "../img/posts/tag_mobile.png"
    },
    {
        "tag": "physical computing",
        "title": "Physical computing",
        "intro": "Physical computing bridges the gaps between the digital and physical worlds, allowing interaction with sensors, controllers and hardware interfaces. IoT devices and robotics are the obvious manifestation of physical computing and are drivers of innovation, however creative uses are emerging around art and design - expanding our interactions with technology and shaping our behaviours."
    },
    {
        "tag": "ubicomp",
        "title": "Ubiquitous computing",
        "intro": "Imagining a world where technology seamlessly integrates into the everday envionment is the heart of ubicomp. Ubiquitous computing make digital interactions virtually invisible, enabling devices to operate autonomously and adapt to users' needs without direct input."
    },
    {
        "tag": "web",
        "title": "Web as platform",
        "intro": "The web has constantly evolved from grey backgrounds and pixelated images to become the centre of our digital experiences. As every new computing innovation has arrived, the web platform absorbs it and becomes stronger - even if it takes some time."
    }
]
